import React from 'react';

const Roadmap = () => {
  return (
    <div className="page-container">
      <h1>Roadmap & Features</h1>
      <h2>Запланированные функциональности:</h2>
      <ul>
        <li>Компьютерный противник - возможность играть против противника с разными уровнями сложности</li>
        <li>Статистика игр - детализированная персональная статистика</li>
        <li>Чат - не уверен, но возможно будет</li>
        <li>Инвентарь - игровые предметы, меняющие состояние поля: бомбы (ножницы), ластик, маркер</li>
        <li>Анимация - анимация ходов, поля, предметов</li>
        <li>Стилизация - изменение вненешнего вида поля под тетрадный лист, а также объектов на поле</li>
        <li>Мобильный адаптив - сложно, но попробую</li>
        <li>Возврат в игру</li>
        <li>Признание поражения</li>
        <li>Локализация en/ru</li>
      </ul>
    </div>
  );
};

export default Roadmap;